Расчетные_задачи_занятие_3/src/Documents/КадровоеИзменение/КадровоеИзменение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КадровоеИзменение</name>
  <basedOn>Document.ПриказОПриеме</basedOn>
  <basedOn>Document.КадровоеИзменение</basedOn>
  <registerRecords>InformationRegister.ПлановыеОсновныеНачисления</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержания</registerRecords>
  <registerRecords>InformationRegister.ПлановыеДополнительныеНачисления</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриказОПриеме</types>
      <types>DocumentRef.КадровоеИзменение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Расчетные_задачи_занятие_3/src/Documents/КадровоеИзменение/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриказОПриеме") Тогда

		ДокументОснование = ДанныеЗаполнения;
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ФизическоеЛицо = ДанныеЗаполнения.ФизическоеЛицо;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КадровоеИзменение") Тогда

		ДокументОснование = ДанныеЗаполнения;
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ФизическоеЛицо = ДанныеЗаполнения.ФизическоеЛицо;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Сервер.ПроверитьНаличиеОдногоНачисленияЗачетОтработанногоВремени(Ссылка, Отказ)

КонецПроцедуры
